In [1]:
import pandas as pd
#pandas

In [2]:
data = {
    'name':['A','B','C'],
    'age':[34,23,14],
    'marks':[ 56,62,89]
}

In [3]:
df =pd.DataFrame(data)

In [4]:
df

  name  age  marks
0    A   34     56
1    B   23     62
2    C   14     89

In [7]:
df.to_csv('my.csv')

In [8]:
df

  name  age  marks
0    A   34     56
1    B   23     62
2    C   14     89

In [9]:
#to read data set 
# how to read dataset
# df1 = pd.read_csv('path of data\name of data\file extension')

In [11]:
df2 = pd.read_csv(r'C:\Users\asus\Downloads\WD_ML_10am_20june-main\WD_ML_10am_20june-main\Bengaluru_House_Data.csv')

In [12]:
df2

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,@@@@@@,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.00

In [13]:
df2.head()
#top five elements of dataset

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,@@@@@@,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [14]:
df2.tail()
#last five elements of dataset

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.0
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.0
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.0
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.0
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.0

In [16]:
df2.sample(4)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
6122,Super built-up Area,Ready To Move,Rachenahalli,3 BHK,Sovar S,1550,3.0,2.0,72.50
3140,Super built-up Area,Ready To Move,Hennur Road,5 BHK,NaN,5600,5.0,3.0,515.00
8807,Super built-up Area,18-Aug,Electronic City,2 BHK,Prarkun,1128,2.0,1.0,65.40
7305,Super built-up Area,17-Jul,Anandapura,2 BHK,ViensRK,1151,2.0,1.0,43.16

In [17]:
df2.shape

(13320, 9)

In [19]:
df2.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [20]:
df2.isnull()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,True,False,False,False,False
...,...,...,...,...,...,...,...,...,...
13315,False,False,False,False,False,False,False,False,False
13316,False,False,False,False,True,False,False,True,False
13317,False,False,False,False,False,False,False,False,False
13318,False,False,False,False,False,False,False,False,False
13319,False,False,False,False,True,False,False,False,False

In [21]:
#data cleaning
#data in wrong format
#wrong data 
#dublicates

In [22]:
df2.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5501
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [24]:
total_data = df2.shape[0]

In [30]:
null_value_in_society = df2['society'].isnull().sum()

In [31]:
null_value_in_society

5501

In [32]:
per_of_null_value = (null_value_in_society/total_data)*100

In [33]:
per_of_null_value

41.2987987987988

In [34]:
# ignore
# del
# random


# mean------->  mrks avg----> data distribution is high.
# median------> middle value

# 5lpa
# mode-----> value having high frequency

In [37]:
df2['price'].sum()/len(df2)

112.5656265015015

In [38]:
df2['price'].mean()

112.5656265015015

In [39]:
df2['price'].median()

72.0

In [40]:
df2['price'].mode()

0    75.0
Name: price, dtype: float64

In [41]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7819 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [46]:
mode_of_society =df2['society'].mode()

In [48]:
society = df2.fillna(value = mode_of_society[0],inplace = True)

In [51]:
df2['society'].isnull().sum()
#fill in the empty place

0